import QuestionModel from "../models/question.model"

const questionsSection2Constant: Array<QuestionModel> = [
  {
    question:
      "ถ้าสมมติว่ามีเพื่อนน้องชื่อ อาร์ต มาเล่าให้น้องฟังว่า มีเพื่อนสนิทของน้องที่ชื่อ โอม ไปพูดให้เพื่อนคนอื่นฟังว่า น้องเป็นคนไม่มีความรับผิดชอบ เพราะน้องไม่ช่วยทำงานกลุ่ม  แต่ในขณะเดียวกันน้องก็เริ่มสังเกตได้เหมือนกันว่า มีเพื่อนบางคนเริ่มตีตัวออกห่างและไม่ค่อยอยากคุยด้วย น้องจะรับมือสถานการณ์นี้อย่างไรและจะทำอย่างไรกับโอม     (ไม่เกิน 200 คำ)",
    type: "multiline"
  },
  {
    question:
      "ถ้าน้องต้องทำงานคู่กับเพื่อน ซึ่งเป็นโครงงานจบการศึกษาที่ต้องนำเสนอในวันมะรืนนี้ จึงต้องมีการซ้อมนำเสนอกับอาจารย์ โดยน้องนัดอาจารย์ไว้เพื่อซ้อมนำเสนอเย็นวันนี้ ทันใดนั้นเอง อาจารย์ส่งอีเมลมาว่า “อาจารย์ติดธุระด่วนนะลูก เลื่อนซ้อมนำเสนอเป็นวันพรุ่งนี้แทนได้ไหม” แต่เพื่อนน้องติดธุระ ไม่ว่างมาซ้อมกับอาจารย์ในวันพรุ่งนี้ น้องจะทำอย่างไร (ไม่เกิน 200 คำ)",
    type: "multiline"
  },
  {
    question:
      "น้องได้รับมอบหมายให้เป็นตัวแทนในการพูดแนะแนวเกี่ยวกับคณะวิศวกรรมศาสตร์ให้กับโรงเรียนที่น้องจบการศึกษามา โดยกิจกรรมจะเริ่มเวลา 09:00 น. แต่น้องตื่นนอนตอน 08:50 น. ซึ่งการเดินทางไปสถานที่จัดงานต้องใช้เวลาอย่างน้อย 30 นาที น้องจะแก้ไขปัญหาเฉพาะหน้าที่เกิดขึ้นและจะรับผิดชอบต่อเหตุการณ์นี้อย่างไร (ไม่เกิน 200 คำ)",
    type: "multiline"
  },
  {
    question:
      "ระหว่างที่น้องเดินอยู่กลางถนน เขตปทุมวัน อยู่ ๆ น้องก็ตกท่อระบายน้ำที่มีคนเปิดซ่อมแซมทิ้งไว้ หลังจากสลบไปสักพัก น้องลืมตาขึ้นมาพบว่าน้องได้วาร์ปไปเกิดใหม่ที่ต่างโลก มีเสียงจากระบบดังมาในหัวว่า “คุณถูกย้ายมาที่โลก Minecraft แมพปราสาทแดง ที่ทุกคนเป็นคนดี เฟรนลี่ คุณมีเวลา 127 วัน ต้องเอาชีวิตรอดในโลกนี้ให้ได้ เพื่อจะสามารถกลับไปยังโลกเดิมได้” หลังจากนั้นมีชาวบ้านในพื้นที่เดินมาทักน้องด้วยหน้าตายิ้มแย้มว่า “tung tung tung sahur” ซึ่งเป็นภาษาที่น้องฟังไม่รู้เรื่องเลย!! i) น้องจะทำยังไงกับชาวบ้านคนนั้น ii) จะทำยังไงกับเวลาที่เหลือในโลกปราสาทแดงแห่งนี้ดี (ไม่เกิน 250 คำ)",
    type: "multiline"
  },
  {
    question:
      "ในโลกอนาคตที่เทคโนโลยีก้าวหน้า แต่ปัญหาสิ่งแวดล้อมกลับย่ำแย่ลง ทั้งปัญหาน้ำท่วมโลกและปัญหามลพิษ อีกทั้งยังมีดาวเคราะห์น้อยที่กำลังจะพุ่งชนโลกอีกใน 2 วันข้างหน้า และทันใดนั้นเอง น้องก็ได้รู้จักกับหุ่นยนต์ตัวเจ๋งที่มีชื่อว่า โดเรม่อน ที่สามารถช่วยให้น้องสร้างเทคโนโลยีอะไรก็ได้ตามที่ต้องการภายในเวลา 10 วินาที แต่หุ่นยนต์ตัวนี้มีพลังงานที่สามารถสร้างสิ่งของได้เพียงอย่างเดียวเท่านั้น ถ้าน้องเป็นหนึ่งคนในมนุษย์กลุ่มสุดท้ายที่ยังคงอยู่ในโลกนี้ น้องจะเลือกสร้างอุปกรณ์อะไร (ให้อธิบายหลักการของอุปกรณ์ที่น้องสร้าง) และอุปกรณ์ที่น้องสร้างนั้น สามารถช่วยโลกให้กลับมาเป็นบ้านที่แสนสุขของมนุษยชาติได้อย่างไร (ไม่เกิน 250 คำ)",
    type: "multiline"
  }
]

export { questionsSection2Constant }
