import QuestionModel from "../models/question.model"

const questionsSection2Constant: Array<QuestionModel> = [
  {
    question:
      "ถ้าน้องได้รับมอบหมายให้ทำโครงงานประดิษฐ์ด้านวิศวกรรมแบบกลุ่มเพื่อนำเสนอต่อกรรมการ โดยได้รับการจัดกลุ่มแบบสุ่ม 5 คน ซึ่งในการทำโครงงานจะต้องมีการแบ่งหน้าที่กัน แต่สมาชิกกลุ่มยังไม่มีใครเริ่มพูดอะไรเลย น้องจะทำอย่างไรให้งานดำเนินต่อไปได้? (ไม่เกิน 200 คำ)",
    type: "multiline"
  },
  {
    question:
      "ทั่วโลกกำลังประสบปัญหาภัยพิบัติจากสัตว์ประหลาด นำมาซึ่งความเสียหายทั่วโลก แล้วน้องเป็นคนเดียวที่รับเลือกให้ย้อนเวลากลับมา 5 ปีก่อนเกิดเหตุ และได้รับพลังวิเศษอย่างนึง น้องจะเลือกพลังอะไร และจะใช้พลังนั้นอย่างไร? (ไม่เกิน 200 คำ)",
    type: "multiline"
  },
  {
    question:
      "ถ้าอาจารย์สั่งให้ทำงานกลุ่ม “เขียนโปรแกรมแก้ปัญหาที่เกิดขึ้นตามโจทย์ที่ได้รับของแต่ละกลุ่ม” แล้วเพื่อนกลุ่มข้าง ๆ ติดปัญหาและเป็นปัญหาที่ตัวน้องเองสามารถช่วยแก้ไขปัญหาได้ แต่กลุ่มของน้องยังทำงานไม่เสร็จ และจะถึงเวลากำหนดส่งในอีก 10 นาที น้องจะมีวิธีแก้ไขสถานการณ์นี้อย่างไรให้เหมาะสมที่สุด และคิดว่าผลลัพธ์จะเป็นอย่างไร (งานกลุ่มเพื่อนเสร็จ/งานกลุ่มเราเสร็จ/งานเสร็จทั้งสองกลุ่ม) (ไม่เกิน 200 คำ)",
    type: "multiline",
    imagePath:
      "https://cdn.discordapp.com/attachments/927853004990873620/1238767040781881385/rn_image_picker_lib_temp_e1b6db4e-3a77-4b95-bfa5-d6a2861f392b.jpg?ex=66d2d1b5&is=66d18035&hm=9f8a2d9c0ec45ab6322b2069a5f8a2d4b1e4eabfb6ce03516ac4ff627c78ba7d&"
  },
  {
    question:
      "ในค่ายนี้น้องจะได้รับการจัดกลุ่มโดยพี่ ๆ แบบสุ่ม ซึ่งน้องจะต้องอยู่กับเพื่อนในกลุ่มไปจนจบค่าย ถ้าน้องกับเพื่อนในกลุ่มเกิดทะเลาะกัน เพราะมีความเห็นไม่ตรงกันในระหว่างที่ค่ายจัดอยู่ จะรับมือ/แก้ไขกับปัญหานี้อย่างไร (ไม่เกิน 200 คำ)",
    type: "multiline",
    imagePath: "../../assets/images/background/bg1.jpg"
  },
  {
    question:
      "ในการสอบเก็บคะแนนวิชาคณิตศาสตร์ออนไลน์ที่มีลักษณะคำถามเป็นแบบปรนัย (กาช้อยที่ถูกที่สุด) ซึ่งเป็นวิชาที่น้องถนัดมาก ขณะที่น้องกำลังทำข้อสอบพบว่าเพื่อนสนิทของน้องส่งข้อความมาบอกว่าทำข้อสอบไม่ได้ และเพื่อนอาจจะติด มผ (ไม่ผ่านรายวิชา) หากน้องกดอ่านข้อความนั้นไปแล้ว น้องจะรับมือกับสถานการณ์นี้อย่างไร (ไม่เกิน 200 คำ)",
    type: "multiline",
    imagePath: "src/assets/images/background/bg1.jpg"
  },
  {
    question: "ถ้าน้องต้องสมัครค่ายลานเกียร์น้องจะเลือกโกหกคำตอบหรือพูดความจริง?",
    type: "multiline"
  }
]

export { questionsSection2Constant }
