import QuestionModel from "../models/question.model"

const questionsSection2Constant: Array<QuestionModel> = [
  {
    question:
      "อยากให้น้องเล่าถึงประสบการณ์การแก้ไขปัญหาที่น้องรู้สึกภูมิใจที่สุด และเหตุการณ์ดังกล่าวส่งผลต่อตัวน้องในปัจจุบันอย่างไร (120 ถึง 250 คำ)",
    type: "multiline"
  },
  {
    question:
      "สมมติว่า ถ้าน้องได้มาเข้าร่วมค่ายลานเกียร์ แล้วตอนเข้าร่วมกิจกรรมตามแต่ละฐาน มีเพื่อนคนหนึ่งในกลุ่มเดียวกับน้องที่มักจะพูดแทรกพูดขัดคนอื่นอยู่ตลอด จนน้องและเพื่อน ๆ รู้สึกไม่พอใจ หากน้องอยู่สถานการณ์ดังกล่าว น้องจะทำอย่างไร (ไม่เกิน 250 คำ)",
    type: "multiline"
  },
  {
    question:
      "ถ้าให้เปรียบเทียบน้องกับตัวละคร 1 ตัวละคร จากภาพยนตร์ การ์ตูน ละคร หรือ ซีรีส์ น้องคิดว่าน้องเหมือนตัวละครอะไร และทำไมน้องถึงคิดเช่นนั้น (ไม่เกิน 250 คำ)",
    type: "multiline"
  },
  {
    question:
      "ถ้าหากว่าน้องต้องจับกลุ่มกับเพื่อนโดยที่ต้องจับกลุ่มสมาชิกกลุ่มละ 5 คน โดยตอนนี้กลุ่มของน้องมีสมาชิกทั้งหมด 4 คน และมีเพื่อนสองคนสุดท้ายที่ยังไม่มีกลุ่มเหลืออยู่คือ </br>1. เพื่อนที่น้องไม่ชอบ </br>2. เพื่อนที่คนในกลุ่มไม่ชอบ </br>หากน้องอยู่ในสถานการณ์ดังกล่าว น้องจะตัดสินใจอย่างไร เพราะเหตุใดจึงเป็นเช่นนั้น (ไม่เกิน 250 คำ)",
    type: "multiline"
  },
  {
    question:
      "ในการทำงานกลุ่ม ถ้างานในส่วนที่เรารับผิดชอบเกิดปัญหาขึ้น ทำให้น้องได้รับความคิดเห็นเชิงลบจากเพื่อน ๆ ในทีมเกี่ยวกับความผิดพลาดของตัวเรา  ซึ่งทำให้เกิดการกระทบกระทั่งกัน อีกทั้งเพื่อนในทีมมีการใช้น้ำเสียงและคำพูดที่ไม่เหมาะสมกับเรา หากอยู่ในสถานการณ์ดังกล่าวน้องจะรับมือกับเหตุการณ์นี้อย่างไร	(ไม่เกิน 250 คำ)",
    type: "multiline"
  },
  {
    question: "ให้น้องเล่าเรื่องที่มีคนทำให้น้องไม่พอใจ และให้น้องอธิบายเหตุผลของคู่กรณีว่าทำไมเขาถึงทำอย่างนั้น (120 ถึง 250 คำ)",
    type: "multiline"
  }
]

export { questionsSection2Constant }
