import QuestionModel from "../models/question.model"

const questionsSection2Constant: Array<QuestionModel> = [
  {
    question:
      "สมมติว่าน้องทำพานไหว้ครูกับเพื่อนอีก 2 คน คือ นายนอร์ทและนายนัท แต่เกิดเหตุการณ์ที่ทำให้เพื่อนของน้องทั้ง 2 คนทะเลาะกัน ทำให้นายนอร์ทไม่คุยกับนายนัท และไม่ช่วยทำพานเลย โดยนายนัทเล่าให้น้องฟังว่านายนอร์ทไม่เห็นด้วยกับไอเดียที่ตกลงกันภายในกลุ่ม จึงมีปากเสียงกัน ถ้าน้องเจอเหตุการณ์นี้ น้องจะทำอย่างไร (ไม่เกิน 250 คำ)",
    type: "multiline"
  },
  {
    question:
      "ถ้าน้องต้องทำงานร่วมกันกับเพื่อนต่างโรงเรียนที่ไม่เคยรู้จักกันมาก่อน แล้วต้องทำงานให้เสร็จภายในเวลาเพียง 30 นาที น้องจะวางแผนและจัดการกับเหตุการณ์นี้อย่างไร (ไม่เกิน 250  คำ)",
    type: "multiline"
  },
  {
    question:
      "ถ้าให้เปรียบเทียบน้องกับตัวละคร 1 ตัวละครจากภาพยนตร์ การ์ตูน ละคร หรือซีรีส์ น้องคิดว่าน้องเหมือนตัวละครอะไร และทำไมน้องถึงคิดเช่นนั้น (ไม่เกิน 250 คำ)",
    type: "multiline"
  },
  {
    question:
      "ให้น้องเล่าเหตุการณ์ที่เคยมีคนทำให้น้องโกรธในช่วงมัธยม ตัวน้อง ณ ตอนนั้นจัดการกับเหตุการณ์นั้นอย่างไร และถ้าเป็นตัวน้องในปัจจุบันจะจัดการกับเหตุการณ์นั้นด้วยวิธีเดิมหรือไม่ อย่างไร (ไม่เกิน 250 คำ)",
    type: "multiline"
  },
  {
    question:
      "อะไรเป็นนิสัยหรือพฤติกรรมที่ไม่ดีของน้องที่น้องจะไม่ยอมเปลี่ยน ให้น้องอธิบายพร้อมทั้งให้เหตุผลประกอบ (ไม่เกิน 250 คำ)",
    type: "multiline"
  },
  {
    question: "สมมติว่าตอนนี้น้องเป็นวิศวกรที่เก่งระดับโลก ถ้าให้น้องประดิษฐ์อะไรขึ้นมา 1 อย่าง น้องจะประดิษฐ์อะไร แล้วทำไมถึงต้องเป็นสิ่งนี้ (ไม่เกิน 250 คำ)",
    type: "multiline"
  }
]

export { questionsSection2Constant }
