const ruleConstant = [
  {
    title: "เอกสารที่จำเป็นต้องดาวน์โหลดไปใช้",
    contents: ["ใบตอบรับผู้ปกครองค่ายลานเกียร์ ครั้งที่ 21"]
  },
  {
    title: "เอกสารที่ต้องแนบเพิ่มเติม",
    contents: [
      "รูปถ่ายหน้าตรง เห็นหน้าชัดเจน เช่นรูปติดบัตร (.jpg / .png)",
      "ใบตอบรับผู้ปกครองค่ายลานเกียร์ ครั้งที่ 21 (.pdf / .jpg / .png)",
      "ใบ ปพ.1 หรือ 7 (.pdf / .jpg / .png)"
    ]
  },
  {
    title: "ขั้นตอนการสมัคร",
    contents: [
      "กรอกข้อมูลส่วนตัว การศึกษา สุขภาพ และช่องทางการติดต่อ",
      "ตอบคำถามที่พี่ ๆ เตรียมไว้ให้",
      "อัพโหลดเอกสารดังที่กล่าวไว้ข้างต้น",
      "ยืนยันการสมัคร"
    ]
  }
]
export { ruleConstant }
