import StatusInfoModel from "../models/statusInfo.model"

const statusInfoConstant: StatusInfoModel = {
  start: {
    title: "เริ่มต้นการสมัครค่ายลานเกียร์ครั้งที่ 20",
    contents: ["ขอให้น้อง ๆ กดที่ปุ่มสีเขียวด้านบนเพื่อเริ่มต้นการกรอกข้อมูลเพื่อสมัครเข้าค่าย โดยน้อง ๆ ไม่จำเป็นจะต้องกรอกให้เสร็จภายในครั้งเดียว"]
  },
  continue: {
    title: "กรอกข้อมูลสมัครค่ายต่อจากครั้งที่แล้ว",
    contents: ["ขอให้น้อง ๆ กดที่ปุ่มสีเหลืองด้านบนเพื่อกรอกข้อมูลสมัครเข้าค่ายต่อจากครั้งที่แล้ว"]
  },
  pending: {
    title: "รอการตรวจสอบเอกสาร",
    contents: [
      "ขณะนี้อยู่ในขั้นตอนการรอตรวจสอบเอกสารที่น้อง ๆ ได้แนบเข้ามาอยู่ ขอให้น้องเข้ามาเช็คสถานะของเอกสารที่เว็บนี้เป็นประจำเผื่อในกรณีที่เอกสารที่น้องแนบมาไม่ผ่านเกณฑ์"
    ]
  },
  docOk: {
    title: `เอกสารข้อมูล<span style="color: #39B774">ถูกต้อง</span>`,
    contents: [
      "เอกสารที่น้องได้แนบมาผ่านตามข้อกำหนด ขอให้น้องเข้ามาเช็คที่เว็บนี้เป็นประจำเพื่อรับทราบสถานะผลการคัดเลือกเพื่อให้ได้สัมภาษณ์และสิ่งที่น้องจะต้องทำต่อไป"
    ]
  },
  docNotOk: {
    title: `เอกสารที่แนบมา<span style="color: #941014">ไม่ผ่าน</span>ตามข้อกำหนด`,
    contents: ["เอกสารดังต่อไปนี้ไม่ผ่านตามข้อกำหนด", "ขอให้น้องแก้ไขเอกสารการสมัครและยืนยันการสมัครอีกครั้งภายในวันที่ 21 ตุลาคม 2563 เวลา 23:59 น."]
  },
  passedInterview: {
    title: `น้องเป็น<span style="color: #39B774">ผู้มิสิทธิ์</span>เข้าร่วมการสัมภาษณ์`,
    contents: [
      "ขอแสดงความยินดีด้วยนะครับ น้องเป็นผู้มีสิทธิ์สัมภาษณ์เพื่อเข้าร่วมค่ายลานเกียร์ครั้งที่ 20 โดยการสัมภาษณ์จะมีในวันที่ (รอรายละเอียดตามรหัส LG)"
    ]
  },
  failedInterview: {
    title: `น้อง<span style="color: #941014">ไม่ใช่ผู้มิสิทธิ์</span>เข้าร่วมการสัมภาษณ์`,
    contents: [
      "ขอแสดงความเสียใจด้วยนะครับ น้องไม่ผ่านการคัดเลือก แต่ไม่ต้องเสียใจไปนะ! พวกพี่ยินดีให้คำปรึกษาได้ทุก ๆ เรื่องเลย โดยน้องสามารถทักเข้ามาได้ที่เพจเฟสบุ๊ค LARNGEAR CAMP ที่อยู่ด้านล่างนี้ได้เลยนะครับ :)"
    ]
  },
  passedFinal: {
    title: `น้อง<span style="color: #39B774">ผ่าน</span>การคัดเลือกในการเข้าร่วมค่ายลานเกียร์ครั้งที่ 20!`,
    contents: [
      "ขอแสดงความยินดีด้วยนะครับ น้องเป็นหนึ่งในผู้ที่มีสิทธิ์เข้าร่วมค่ายลานเกียร์ครั้งที่ 20 อย่างเป็นทางการแล้วนะครับ โดยวันค่ายจะจัดขึ้นในวันที่ 8 - 11 มกราคม 2564 ที่คณะวิศวกรรมศาสตร์ จุฬาลงกรณ์มหาวิทยาลัยนั่นเอง โดยข้อมูลเพิ่มเติมหลังจากนี้จะมีการประกาศผ่านเฟสบุ๊คเพจ LARNGEAR CAMP ซึ่งอยู่ด้านล่างของข้อความนี้แล้ว ไว้เจอกันที่ลานเกียร์นะครับ :)"
    ]
  },
  failedFinal: {
    title: `น้อง<span style="color: #941014">ผ่าน</span>การคัดเลือกในการเข้าร่วมค่ายลานเกียร์ครั้งที่ 20`,
    contents: [
      "ขอแสดงความเสียใจด้วยนะครับ น้องไม่ผ่านการคัดเลือก แต่ไม่ต้องเสียใจไปนะ! พวกพี่ยินดีให้คำปรึกษาได้ทุก ๆ เรื่องเลย โดยน้องสามารถทักเข้ามาได้ที่เพจเฟสบุค LARNGEAR CAMP ที่อยู่ด้านล่างนี้ได้เลยนะครับ :)"
    ]
  }
}

export default statusInfoConstant
